[
  {
    "category": "Implementation Guidelines",
    "description": "Guard rails and best practices to follow throughout implementation to ensure high-quality, maintainable code.",
    "steps": [
      "Keep TypeScript strict; avoid 'any' and prefer explicit types for events, payloads, and configs.",
      "Use Rust Result and error propagation; avoid unwrap/expect in non-test code.",
      "All Tauri commands must have matching TypeScript typings and UI invocations.",
      "No hard-coded hotkeys; read from config and validate before registration.",
      "Minimize platform-specific shell commands; prefer native APIs or well-isolated helpers.",
      "Add unit tests for config parsing and hotkey normalization logic.",
      "Add integration coverage for capture -> popup -> editor flows.",
      "No console.log in production UI; use a gated debug logger.",
      "Keep functions focused; extract helpers for image/clipboard/OCR pipelines.",
      "Document any macOS permissions and Vision framework requirements."
    ],
    "passes": true
  },
  {
    "category": "Repo Audit Findings",
    "description": "Bugs, mismatches, or gaps identified during review that should be addressed before feature work builds on them.",
    "steps": [
      "Normalize hotkey format: config defaults use 'Cmd+Shift+2' while global shortcut registration uses 'command+shift+s'; pick one format and add conversion helpers.",
      "Update TypeScript ScreenshotData/EditorData to include filename and file_path if they are emitted; ensure UI ignores unknown fields safely.",
      "Remove or gate verbose console logging in hooks and editor (screenshot-data/editor-data listeners).",
      "Correct clipboard copy format: AppleScript currently reads PNG as JPEG; update to preserve PNG (alpha) or use native clipboard APIs.",
      "Wire preferences to actual global shortcut registration (tray labels, registrations, and in-app help text)."
    ],
    "passes": false
  },
  {
    "category": "Annotation Editor Reliability",
    "description": "Stabilize the annotation UI and fix the MacBook display framing issue while completing missing tooling.",
    "steps": [
      "Reproduce the MacBook display framing bug; capture logs for container size, image size, and computed zoom on Retina and external displays.",
      "Adjust canvas sizing/zoom logic to handle devicePixelRatio and Fabric scaling correctly; ensure the image always fits the editor viewport on Retina.",
      "Persist and restore editor state between zoom recalculations to prevent jumpy rendering.",
      "Implement undo/redo history stack for Fabric operations (add/remove/transform/text edits).",
      "Make arrow tool a grouped object so the head stays attached when moved/edited.",
      "Replace redact tool with actual blur (Fabric filters + clipping) instead of solid rectangles.",
      "Verify border radius and background changes update the export output and on-screen preview identically.",
      "Add tests or a manual verification checklist for all tools: select, rect, ellipse, arrow, line, text, blur, padding, background, border radius."
    ],
    "passes": false
  },
  {
    "category": "Auto Copy After Capture",
    "description": "Implement automatic copy-to-clipboard behavior after capture with user preferences and safe fallbacks.",
    "steps": [
      "Add config flags for auto_copy_after_capture and auto_copy_after_edit.",
      "Trigger copy_to_clipboard after capture when enabled, before showing the popup (or immediately after popup emission).",
      "Trigger copy_edited_screenshot after save if auto_copy_after_edit is enabled.",
      "Surface toggle in preferences UI and ensure it round-trips with config persistence.",
      "Add telemetry/logging hooks behind a debug flag to confirm clipboard success/failure.",
      "Update user-facing text to reflect auto-copy behavior and potential permissions/clipboard errors."
    ],
    "passes": false
  },
  {
    "category": "Preferences Page Upgrade",
    "description": "Expand preferences to support key bindings and capture/editor behaviors with a more robust UX.",
    "steps": [
      "Add config fields for capture_hotkey, fullscreen_hotkey, preferences_hotkey, auto_background, auto_copy_after_capture, auto_copy_after_edit.",
      "Implement hotkey recorder UI that validates modifier + key, prevents reserved system shortcuts, and shows conflicts.",
      "Apply updated hotkeys by re-registering global shortcuts at runtime; update tray menu labels accordingly.",
      "Add toggles for auto background and copy-after-capture; wire to config persistence.",
      "Define auto background behavior for editor (e.g., default gradient on open, or use last-used background).",
      "Migrate existing config values to new schema with safe defaults."
    ],
    "passes": false
  },
  {
    "category": "OCR Text Extraction (macOS Vision)",
    "description": "Extract and copy text from screenshots using the native macOS Vision framework.",
    "steps": [
      "Add a Rust command extract_text_from_image that accepts base64 PNG data and returns recognized text plus confidence metadata.",
      "Implement Vision integration via a small Swift/Objective-C helper or a Rust FFI bridge; keep it macOS-only and feature-flagged.",
      "Expose OCR action in the popup and editor (Copy Text) with a loading state and error handling.",
      "Add a preference to auto-copy OCR text after capture when enabled.",
      "Document required entitlements and ensure OCR does not block the UI thread."
    ],
    "passes": false
  },
  {
    "category": "Validation & QA",
    "description": "Ensure new functionality is stable across hardware configurations and user flows.",
    "steps": [
      "Test on Retina MacBook and at least one external display with different scale factors.",
      "Verify clipboard copy for PNG retains transparency and matches preview output.",
      "Verify global hotkey changes take effect without app restart.",
      "Verify preferences persistence across restarts and config migration.",
      "Verify OCR results on dark/light backgrounds and small font sizes.",
      "Add a regression checklist for capture -> popup -> editor -> save/copy flows."
    ],
    "passes": false
  }
]
