[
  {
    "category": "Implementation Guidelines",
    "description": "Guard rails and best practices to follow throughout implementation to ensure high-quality, maintainable code.",
    "steps": [
      "Keep TypeScript strict; avoid 'any' and prefer explicit types for events, payloads, and configs.",
      "Use Rust Result and error propagation; avoid unwrap/expect in non-test code.",
      "All Tauri commands must have matching TypeScript typings and UI invocations.",
      "No hard-coded hotkeys; read from config and validate before registration.",
      "Minimize platform-specific shell commands; prefer native APIs or well-isolated helpers.",
      "Add unit tests for config parsing and hotkey normalization logic.",
      "Add integration coverage for capture -> popup -> editor flows.",
      "No console.log in production UI; use a gated debug logger.",
      "Keep functions focused; extract helpers for image/clipboard/OCR pipelines.",
      "Document any macOS permissions and Vision framework requirements."
    ],
    "passes": true
  },
  {
    "category": "Repo Audit Findings",
    "description": "Bugs, mismatches, or gaps identified during review that should be addressed before feature work builds on them.",
    "steps": [
      "Update TypeScript ScreenshotData/EditorData to include filename and file_path if they are emitted; ensure UI ignores unknown fields safely. (done 2026-02-02 - types already aligned with filename/file_path fields)",
      "Remove or gate verbose console logging in hooks and editor (screenshot-data/editor-data listeners). (done 2026-02-02 - added debugLog utility and gated verbose logs in useScreenshot.ts and useEditor.ts)",
      "Correct clipboard copy format: AppleScript currently reads PNG as JPEG; update to preserve PNG (alpha) or use native clipboard APIs. (done 2026-02-02)",
      "Wire preferences to actual global shortcut registration (tray labels, registrations, and in-app help text). (done 2026-02-02)"
    ],
    "passes": true
  },
  {
    "category": "Annotation Editor Reliability",
    "description": "Stabilize the annotation UI and fix the MacBook display framing issue while completing missing tooling.",
    "steps": [
      "Reproduce the MacBook display framing bug; capture logs for container size, image size, and computed zoom on Retina and external displays.",
      "Adjust canvas sizing/zoom logic to handle devicePixelRatio and Fabric scaling correctly; ensure the image always fits the editor viewport on Retina.",
      "Persist and restore editor state between zoom recalculations to prevent jumpy rendering.",
      "Implement undo/redo history stack for Fabric operations (add/remove/transform/text edits). (done 2026-02-03 - history stack with Cmd+Z/Cmd+Shift+Z shortcuts and UI buttons)",
      "Make arrow tool a grouped object so the head stays attached when moved/edited. (done 2026-02-03 - arrow now uses fabric.Group containing Line and Triangle that move together)",
      "Replace redact tool with actual blur (Fabric filters + clipping) instead of solid rectangles. (done 2026-02-03 - blur tool now pixelates the underlying image region using Fabric.js Pixelate filter)",
      "Verify border radius and background changes update the export output and on-screen preview identically.",
      "Add tests or a manual verification checklist for all tools: select, rect, ellipse, arrow, line, text, blur, padding, background, border radius."
    ],
    "passes": false
  },
    {
    "category": "Auto Copy After Capture",
    "description": "Implement automatic copy-to-clipboard behavior after capture with user preferences and safe fallbacks.",
    "steps": [
      "Add config flags for auto_copy_after_capture and auto_copy_after_edit. (done 2026-02-02)",
      "Trigger copy_to_clipboard after capture when enabled, before showing the popup (or immediately after popup emission). (done 2026-02-02)",
      "Trigger copy_edited_screenshot after save if auto_copy_after_edit is enabled. (done 2026-02-02)",
      "Surface toggle in preferences UI and ensure it round-trips with config persistence. (done 2026-02-02)",
      "Add telemetry/logging hooks behind a debug flag to confirm clipboard success/failure. (done 2026-02-02 - uses println! with success/failure messages)",
      "Update user-facing text to reflect auto-copy behavior and potential permissions/clipboard errors."
    ],
    "passes": true
  }
]
